Revit 2026 API

# ExportPatternTableRemove Method

---

Removes the pair (key, info) by pattern key.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ExportPatternKey exportPatternKey
)
```
```vb
Public Sub Remove (
	exportPatternKey As ExportPatternKey
)
```
```cpp
public:
void Remove(
	ExportPatternKey^ exportPatternKey
)
```
```fsharp
member Remove :
        exportPatternKey : ExportPatternKey -> unit
```

#### Parameters

exportPatternKey ExportPatternKey
     The export pattern key.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPatternTable Class

Autodesk.Revit.DB Namespace